irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_usart_5635_IUT.c
  tmpreg = USARTx->CR2;

  tmpreg &= ((uint16_t)0xCFFF);


  tmpreg |= (uint32_t)USART_InitStruct->USART_StopBits;


  USARTx->CR2 = (uint16_t)tmpreg;


  tmpreg = USARTx->CR1;

  tmpreg &= ((uint16_t)0xE9F3);




  tmpreg |= (uint32_t)USART_InitStruct->USART_WordLength | USART_InitStruct->USART_Parity |
            USART_InitStruct->USART_Mode;

  USARTx->CR1 = (uint16_t)tmpreg;


  tmpreg = USARTx->CR3;

  tmpreg &= ((uint16_t)0xFCFF);


  tmpreg |= USART_InitStruct->USART_HardwareFlowControl;

  USARTx->CR3 = (uint16_t)tmpreg;



  RCC_GetClocksFreq(&RCC_ClocksStatus);
  
  CS_CMM_PROBE_NODE_STMT(224,2,4) if (usartxbase == ((((uint32_t)0x40000000) + 0x10000) + 0x3800))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1082,988) 
    
    CS_CMM_PROBE_NODE_STMT(224,1,5) apbclock = RCC_ClocksStatus.PCLK2_Frequency;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1083,989) 
    
    CS_CMM_PROBE_NODE_STMT(224,0,6) apbclock = RCC_ClocksStatus.PCLK1_Frequency;
  }


  
  CS_CMM_PROBE_NODE_STMT(225,7,7) if ((USARTx->CR1 & ((u16)0x8000)) != 0)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1084,990) 

    
    CS_CMM_PROBE_NODE_STMT(225,6,8) integerdivider = ((25 * apbclock) / (2 * (USART_InitStruct->USART_BaudRate)));
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1085,991) 

    
    CS_CMM_PROBE_NODE_STMT(225,5,9) integerdivider = ((25 * apbclock) / (4 * (USART_InitStruct->USART_BaudRate)));
  }
  
  CS_CMM_PROBE_NODE_STMT(225,4,10) tmpreg = (integerdivider / 100) << 4;


  fractionaldivider = integerdivider - (100 * (tmpreg >> 4));


  
  CS_CMM_PROBE_NODE_STMT(225,3,11) if ((USARTx->CR1 & ((u16)0x8000)) != 0)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1086,992) 
    
    CS_CMM_PROBE_NODE_STMT(225,2,12) tmpreg |= ((((fractionaldivider * 8) + 50) / 100)) & ((uint8_t)0x07);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1087,993) 
    
    CS_CMM_PROBE_NODE_STMT(225,1,13) tmpreg |= ((((fractionaldivider * 16) + 50) / 100)) & ((uint8_t)0x0F);
  }


  
  CS_CMM_PROBE_NODE_STMT(225,0,14) USARTx->BRR = (uint16_t)tmpreg;

CS_CMM_PROBE_NODE_STMT(226,7,15) 
 CODESCROLL_FUNC_END(438, 23, 270) } CODESCROLL_FUNC_END_RBRACE 







void USART_StructInit(USART_InitTypeDef* USART_InitStruct)
{ CODESCROLL_FUNC_BEGIN(439, (439, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1088,994) 

  
  CS_CMM_PROBE_NODE_STMT(226,6,0) USART_InitStruct->USART_BaudRate = 9600;
  USART_InitStruct->USART_WordLength = ((uint16_t)0x0000);
  USART_InitStruct->USART_StopBits = ((uint16_t)0x0000);
  USART_InitStruct->USART_Parity = ((uint16_t)0x0000) ;
  USART_InitStruct->USART_Mode = ((uint16_t)0x0004) | ((uint16_t)0x0008);
  USART_InitStruct->USART_HardwareFlowControl = ((uint16_t)0x0000);

CS_CMM_PROBE_NODE_STMT(226,5,1) 
 CODESCROLL_FUNC_END(439, 23, 287) } CODESCROLL_FUNC_END_RBRACE 
/* # 299 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_ClockInit(USART_TypeDef* USARTx, USART_ClockInitTypeDef* USART_ClockInitStruct)
{ CODESCROLL_FUNC_BEGIN(440, (440, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1089,995) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1090,226,4,0)

  uint32_t tmpreg = 0x00;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  tmpreg = USARTx->CR2;

  tmpreg &= ((uint16_t)0xF0FF);





  tmpreg |= (uint32_t)USART_ClockInitStruct->USART_Clock | USART_ClockInitStruct->USART_CPOL |
                 USART_ClockInitStruct->USART_CPHA | USART_ClockInitStruct->USART_LastBit;

  USARTx->CR2 = (uint16_t)tmpreg;

CS_CMM_PROBE_NODE_STMT(226,3,1) 
 CODESCROLL_FUNC_END(440, 23, 322) } CODESCROLL_FUNC_END_RBRACE 







void USART_ClockStructInit(USART_ClockInitTypeDef* USART_ClockInitStruct)
{ CODESCROLL_FUNC_BEGIN(441, (441, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1091,996) 

  
  CS_CMM_PROBE_NODE_STMT(226,2,0) USART_ClockInitStruct->USART_Clock = ((uint16_t)0x0000);
  USART_ClockInitStruct->USART_CPOL = ((uint16_t)0x0000);
  USART_ClockInitStruct->USART_CPHA = ((uint16_t)0x0000);
  USART_ClockInitStruct->USART_LastBit = ((uint16_t)0x0000);

CS_CMM_PROBE_NODE_STMT(226,1,1) 
 CODESCROLL_FUNC_END(441, 23, 337) } CODESCROLL_FUNC_END_RBRACE 
/* # 348 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_Cmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(442, (442, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1092,997) 

  
  CS_CMM_PROBE_NODE_STMT(226,0,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(227,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1093,998) 

    
    CS_CMM_PROBE_NODE_STMT(227,6,2) USARTx->CR1 |= ((uint16_t)0x2000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1094,999) 

    
    CS_CMM_PROBE_NODE_STMT(227,5,3) USARTx->CR1 &= ((uint16_t)0xDFFF);
  }

CS_CMM_PROBE_NODE_STMT(227,4,4) 
 CODESCROLL_FUNC_END(442, 23, 364) } CODESCROLL_FUNC_END_RBRACE 
/* # 385 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_ITConfig(USART_TypeDef* USARTx, uint16_t USART_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(443, (443, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1095,1000) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1096,227,3,0)

  uint32_t usartreg = 0x00, itpos = 0x00, itmask = 0x00;
  uint32_t usartxbase = 0x00;

  ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(227,2,1) if (USART_IT == ((uint16_t)0x096A))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1097,1001) 
    
