irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_usart_5635_IUT.c
    CS_CMM_PROBE_NODE_STMT(227,1,2) ((void)0);
  } CS_CMM_ELSE_PROBE_C1(1002) 

  
  CS_CMM_PROBE_NODE_STMT(227,0,3) usartxbase = (uint32_t)USARTx;


  usartreg = (((uint8_t)USART_IT) >> 0x05);


  itpos = USART_IT & ((uint16_t)0x001F);
  itmask = (((uint32_t)0x01) << itpos);

  
  CS_CMM_PROBE_NODE_STMT(228,7,4) if (usartreg == 0x01)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1098,1003) 
    
    CS_CMM_PROBE_NODE_STMT(228,6,5) usartxbase += 0x0C;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(228,5,6) if (usartreg == 0x02)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1099,1004) 
    
    CS_CMM_PROBE_NODE_STMT(228,4,7) usartxbase += 0x10;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1100,1005) 
    
    CS_CMM_PROBE_NODE_STMT(228,3,8) usartxbase += 0x14;
  }
  }
  
  CS_CMM_PROBE_NODE_STMT(228,2,9) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1101,1006) 
    
    CS_CMM_PROBE_NODE_STMT(228,1,10) *(volatile uint32_t*)usartxbase |= itmask;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1102,1007) 
    
    CS_CMM_PROBE_NODE_STMT(228,0,11) *(volatile uint32_t*)usartxbase &= ~itmask;
  }

CS_CMM_PROBE_NODE_STMT(229,7,12) 
 CODESCROLL_FUNC_END(443, 23, 428) } CODESCROLL_FUNC_END_RBRACE 
/* # 444 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_DMACmd(USART_TypeDef* USARTx, uint16_t USART_DMAReq, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(444, (444, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1103,1008) 

  
  CS_CMM_PROBE_NODE_STMT(229,6,0) ((void)0);
  ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(229,5,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1104,1009) 


    
    CS_CMM_PROBE_NODE_STMT(229,4,2) USARTx->CR3 |= USART_DMAReq;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1105,1010) 


    
    CS_CMM_PROBE_NODE_STMT(229,3,3) USARTx->CR3 &= (uint16_t)~USART_DMAReq;
  }

CS_CMM_PROBE_NODE_STMT(229,2,4) 
 CODESCROLL_FUNC_END(444, 23, 462) } CODESCROLL_FUNC_END_RBRACE 
/* # 472 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_SetAddress(USART_TypeDef* USARTx, uint8_t USART_Address)
{ CODESCROLL_FUNC_BEGIN(445, (445, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1106,1011) 

  
  CS_CMM_PROBE_NODE_STMT(229,1,0) ((void)0);
  ((void)0);


  USARTx->CR2 &= ((uint16_t)0xFFF0);

  USARTx->CR2 |= USART_Address;

CS_CMM_PROBE_NODE_STMT(229,0,1) 
 CODESCROLL_FUNC_END(445, 23, 482) } CODESCROLL_FUNC_END_RBRACE 
/* # 495 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_WakeUpConfig(USART_TypeDef* USARTx, uint16_t USART_WakeUp)
{ CODESCROLL_FUNC_BEGIN(446, (446, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1107,1012) 

  
  CS_CMM_PROBE_NODE_STMT(230,7,0) ((void)0);
  ((void)0);

  USARTx->CR1 &= ((uint16_t)0xF7FF);
  USARTx->CR1 |= USART_WakeUp;

CS_CMM_PROBE_NODE_STMT(230,6,1) 
 CODESCROLL_FUNC_END(446, 23, 503) } CODESCROLL_FUNC_END_RBRACE 
/* # 514 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_ReceiverWakeUpCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(447, (447, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1108,1013) 

  
  CS_CMM_PROBE_NODE_STMT(230,5,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(230,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1109,1014) 

    
    CS_CMM_PROBE_NODE_STMT(230,3,2) USARTx->CR1 |= ((uint16_t)0x0002);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1110,1015) 

    
    CS_CMM_PROBE_NODE_STMT(230,2,3) USARTx->CR1 &= ((uint16_t)0xFFFD);
  }

CS_CMM_PROBE_NODE_STMT(230,1,4) 
 CODESCROLL_FUNC_END(447, 23, 530) } CODESCROLL_FUNC_END_RBRACE 
/* # 543 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_LINBreakDetectLengthConfig(USART_TypeDef* USARTx, uint16_t USART_LINBreakDetectLength)
{ CODESCROLL_FUNC_BEGIN(448, (448, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1111,1016) 

  
  CS_CMM_PROBE_NODE_STMT(230,0,0) ((void)0);
  ((void)0);

  USARTx->CR2 &= ((uint16_t)0xFFDF);
  USARTx->CR2 |= USART_LINBreakDetectLength;

CS_CMM_PROBE_NODE_STMT(231,7,1) 
 CODESCROLL_FUNC_END(448, 23, 551) } CODESCROLL_FUNC_END_RBRACE 
/* # 562 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_LINCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(449, (449, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1112,1017) 

  
  CS_CMM_PROBE_NODE_STMT(231,6,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(231,5,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1113,1018) 

    
    CS_CMM_PROBE_NODE_STMT(231,4,2) USARTx->CR2 |= ((uint16_t)0x4000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1114,1019) 

    
    CS_CMM_PROBE_NODE_STMT(231,3,3) USARTx->CR2 &= ((uint16_t)0xBFFF);
  }

CS_CMM_PROBE_NODE_STMT(231,2,4) 
 CODESCROLL_FUNC_END(449, 23, 578) } CODESCROLL_FUNC_END_RBRACE 
/* # 588 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_SendData(USART_TypeDef* USARTx, uint16_t Data)
{ CODESCROLL_FUNC_BEGIN(450, (450, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1115,1020) 

  
  CS_CMM_PROBE_NODE_STMT(231,1,0) ((void)0);
  ((void)0);


  USARTx->DR = (Data & (uint16_t)0x01FF);

CS_CMM_PROBE_NODE_STMT(231,0,1) 
 CODESCROLL_FUNC_END(450, 23, 596) } CODESCROLL_FUNC_END_RBRACE 
/* # 605 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
uint16_t USART_ReceiveData(USART_TypeDef* USARTx)
{ CODESCROLL_FUNC_BEGIN(451, (451, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1116,1021) 

  
