irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_usart_5635_IUT.c
  CS_CMM_PROBE_NODE_STMT(232,7,0) ((void)0);


  
  CS_CMM_PROBE_NODE_STMT(232,6,1) 
   CODESCROLL_FUNC_END(451, 23, 611) return (uint16_t)(USARTx->DR & (uint16_t)0x01FF);
} CODESCROLL_FUNC_END_RBRACE 
/* # 621 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_SendBreak(USART_TypeDef* USARTx)
{ CODESCROLL_FUNC_BEGIN(452, (452, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1117,1022) 

  
  CS_CMM_PROBE_NODE_STMT(232,5,0) ((void)0);


  USARTx->CR1 |= ((uint16_t)0x0001);

CS_CMM_PROBE_NODE_STMT(232,4,1) 
 CODESCROLL_FUNC_END(452, 23, 628) } CODESCROLL_FUNC_END_RBRACE 
/* # 637 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_SetGuardTime(USART_TypeDef* USARTx, uint8_t USART_GuardTime)
{ CODESCROLL_FUNC_BEGIN(453, (453, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1118,1023) 

  
  CS_CMM_PROBE_NODE_STMT(232,3,0) ((void)0);


  USARTx->GTPR &= ((uint16_t)0x00FF);

  USARTx->GTPR |= (uint16_t)((uint16_t)USART_GuardTime << 0x08);

CS_CMM_PROBE_NODE_STMT(232,2,1) 
 CODESCROLL_FUNC_END(453, 23, 646) } CODESCROLL_FUNC_END_RBRACE 
/* # 657 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_SetPrescaler(USART_TypeDef* USARTx, uint8_t USART_Prescaler)
{ CODESCROLL_FUNC_BEGIN(454, (454, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1119,1024) 

  
  CS_CMM_PROBE_NODE_STMT(232,1,0) ((void)0);


  USARTx->GTPR &= ((uint16_t)0xFF00);

  USARTx->GTPR |= USART_Prescaler;

CS_CMM_PROBE_NODE_STMT(232,0,1) 
 CODESCROLL_FUNC_END(454, 23, 666) } CODESCROLL_FUNC_END_RBRACE 
/* # 676 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_SmartCardCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(455, (455, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1120,1025) 

  
  CS_CMM_PROBE_NODE_STMT(233,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(233,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1121,1026) 

    
    CS_CMM_PROBE_NODE_STMT(233,5,2) USARTx->CR3 |= ((uint16_t)0x0020);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1122,1027) 

    
    CS_CMM_PROBE_NODE_STMT(233,4,3) USARTx->CR3 &= ((uint16_t)0xFFDF);
  }

CS_CMM_PROBE_NODE_STMT(233,3,4) 
 CODESCROLL_FUNC_END(455, 23, 691) } CODESCROLL_FUNC_END_RBRACE 
/* # 701 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_SmartCardNACKCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(456, (456, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1123,1028) 

  
  CS_CMM_PROBE_NODE_STMT(233,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(233,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1124,1029) 

    
    CS_CMM_PROBE_NODE_STMT(233,0,2) USARTx->CR3 |= ((uint16_t)0x0010);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1125,1030) 

    
    CS_CMM_PROBE_NODE_STMT(234,7,3) USARTx->CR3 &= ((uint16_t)0xFFEF);
  }

CS_CMM_PROBE_NODE_STMT(234,6,4) 
 CODESCROLL_FUNC_END(456, 23, 716) } CODESCROLL_FUNC_END_RBRACE 
/* # 727 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_HalfDuplexCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(457, (457, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1126,1031) 

  
  CS_CMM_PROBE_NODE_STMT(234,5,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(234,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1127,1032) 

    
    CS_CMM_PROBE_NODE_STMT(234,3,2) USARTx->CR3 |= ((uint16_t)0x0008);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1128,1033) 

    
    CS_CMM_PROBE_NODE_STMT(234,2,3) USARTx->CR3 &= ((uint16_t)0xFFF7);
  }

CS_CMM_PROBE_NODE_STMT(234,1,4) 
 CODESCROLL_FUNC_END(457, 23, 743) } CODESCROLL_FUNC_END_RBRACE 
/* # 758 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_OverSampling8Cmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(458, (458, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1129,1034) 

  
  CS_CMM_PROBE_NODE_STMT(234,0,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(235,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1130,1035) 

    
    CS_CMM_PROBE_NODE_STMT(235,6,2) USARTx->CR1 |= ((u16)0x8000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1131,1036) 

    
    CS_CMM_PROBE_NODE_STMT(235,5,3) USARTx->CR1 &= ((u16)0x7FFF);
  }

CS_CMM_PROBE_NODE_STMT(235,4,4) 
 CODESCROLL_FUNC_END(458, 23, 774) } CODESCROLL_FUNC_END_RBRACE 
/* # 785 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_OneBitMethodCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(459, (459, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1132,1037) 

  
  CS_CMM_PROBE_NODE_STMT(235,3,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(235,2,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1133,1038) 

    
