irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_usart_5635_IUT.c
    CS_CMM_PROBE_NODE_STMT(235,1,2) USARTx->CR3 |= ((u16)0x0800);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1134,1039) 

    
    CS_CMM_PROBE_NODE_STMT(235,0,3) USARTx->CR3 &= ((u16)0xF7FF);
  }

CS_CMM_PROBE_NODE_STMT(236,7,4) 
 CODESCROLL_FUNC_END(459, 23, 801) } CODESCROLL_FUNC_END_RBRACE 
/* # 814 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_IrDAConfig(USART_TypeDef* USARTx, uint16_t USART_IrDAMode)
{ CODESCROLL_FUNC_BEGIN(460, (460, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1135,1040) 

  
  CS_CMM_PROBE_NODE_STMT(236,6,0) ((void)0);
  ((void)0);

  USARTx->CR3 &= ((uint16_t)0xFFFB);
  USARTx->CR3 |= USART_IrDAMode;

CS_CMM_PROBE_NODE_STMT(236,5,1) 
 CODESCROLL_FUNC_END(460, 23, 822) } CODESCROLL_FUNC_END_RBRACE 
/* # 833 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_IrDACmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(461, (461, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1136,1041) 

  
  CS_CMM_PROBE_NODE_STMT(236,4,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(236,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1137,1042) 

    
    CS_CMM_PROBE_NODE_STMT(236,2,2) USARTx->CR3 |= ((uint16_t)0x0002);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1138,1043) 

    
    CS_CMM_PROBE_NODE_STMT(236,1,3) USARTx->CR3 &= ((uint16_t)0xFFFD);
  }

CS_CMM_PROBE_NODE_STMT(236,0,4) 
 CODESCROLL_FUNC_END(461, 23, 849) } CODESCROLL_FUNC_END_RBRACE 
/* # 870 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
FlagStatus USART_GetFlagStatus(USART_TypeDef* USARTx, uint16_t USART_FLAG)
{ CODESCROLL_FUNC_BEGIN(462, (462, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1139,1044) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1140,237,7,0)

  FlagStatus bitstatus = RESET;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(237,6,1) if (USART_FLAG == ((uint16_t)0x0200))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1141,1045) 
    
    CS_CMM_PROBE_NODE_STMT(237,5,2) ((void)0);
  } CS_CMM_ELSE_PROBE_C1(1046) 

  
  CS_CMM_PROBE_NODE_STMT(237,4,3) if ((USARTx->SR & USART_FLAG) != (uint16_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1142,1047) 
    
    CS_CMM_PROBE_NODE_STMT(237,3,4) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1143,1048) 
    
    CS_CMM_PROBE_NODE_STMT(237,2,5) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(237,1,6) 
   CODESCROLL_FUNC_END(462, 23, 890) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 919 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_ClearFlag(USART_TypeDef* USARTx, uint16_t USART_FLAG)
{ CODESCROLL_FUNC_BEGIN(463, (463, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1144,1049) 

  
  CS_CMM_PROBE_NODE_STMT(237,0,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(238,7,1) if ((USART_FLAG & ((uint16_t)0x0200)) == ((uint16_t)0x0200))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1145,1050) 
    
    CS_CMM_PROBE_NODE_STMT(238,6,2) ((void)0);
  } CS_CMM_ELSE_PROBE_C1(1051) 

  
  CS_CMM_PROBE_NODE_STMT(238,5,3) USARTx->SR = (uint16_t)~USART_FLAG;

CS_CMM_PROBE_NODE_STMT(238,4,4) 
 CODESCROLL_FUNC_END(463, 23, 931) } CODESCROLL_FUNC_END_RBRACE 
/* # 952 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
ITStatus USART_GetITStatus(USART_TypeDef* USARTx, uint16_t USART_IT)
{ CODESCROLL_FUNC_BEGIN(464, (464, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1146,1052) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1147,238,3,0)

  uint32_t bitpos = 0x00, itmask = 0x00, usartreg = 0x00;
  ITStatus bitstatus = RESET;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(238,2,1) if (USART_IT == ((uint16_t)0x096A))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1148,1053) 
    
    CS_CMM_PROBE_NODE_STMT(238,1,2) ((void)0);
  } CS_CMM_ELSE_PROBE_C1(1054) 


  
  CS_CMM_PROBE_NODE_STMT(238,0,3) usartreg = (((uint8_t)USART_IT) >> 0x05);

  itmask = USART_IT & ((uint16_t)0x001F);
  itmask = (uint32_t)0x01 << itmask;

  
  CS_CMM_PROBE_NODE_STMT(239,7,4) if (usartreg == 0x01)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1149,1055) 
    
    CS_CMM_PROBE_NODE_STMT(239,6,5) itmask &= USARTx->CR1;
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(239,5,6) if (usartreg == 0x02)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1150,1056) 
    
    CS_CMM_PROBE_NODE_STMT(239,4,7) itmask &= USARTx->CR2;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1151,1057) 
    
    CS_CMM_PROBE_NODE_STMT(239,3,8) itmask &= USARTx->CR3;
  }
  }

  
  CS_CMM_PROBE_NODE_STMT(239,2,9) bitpos = USART_IT >> 0x08;
  bitpos = (uint32_t)0x01 << bitpos;
  bitpos &= USARTx->SR;
  
  CS_CMM_PROBE_NODE_STMT(239,1,10) if (CS_MCDC_464_3((itmask != (uint16_t)RESET), (bitpos != (uint16_t)RESET), 91))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable1152,53) 
    
    CS_CMM_PROBE_NODE_STMT(239,0,11) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable1153,54) 
    
    CS_CMM_PROBE_NODE_STMT(240,7,12) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(240,6,13) 
   CODESCROLL_FUNC_END(464, 23, 996) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1026 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_usart.c"*/
void USART_ClearITPendingBit(USART_TypeDef* USARTx, uint16_t USART_IT)
{ CODESCROLL_FUNC_BEGIN(465, (465, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1154,1058) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1155,240,5,0)

  uint16_t bitpos = 0x00, itmask = 0x00;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(240,4,1) if (USART_IT == ((uint16_t)0x096A))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1156,1059) 
    
    CS_CMM_PROBE_NODE_STMT(240,3,2) ((void)0);
  } CS_CMM_ELSE_PROBE_C1(1060) 

  
  CS_CMM_PROBE_NODE_STMT(240,2,3) bitpos = USART_IT >> 0x08;
  itmask = ((uint16_t)0x01 << (uint16_t)bitpos);
  USARTx->SR = (uint16_t)~itmask;

CS_CMM_PROBE_NODE_STMT(240,1,4) 
 CODESCROLL_FUNC_END(465, 23, 1041) } CODESCROLL_FUNC_END_RBRACE 
